#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

aws_default_vpc_dhcp_options.default: Refreshing state... [id=dopt-0308d4ebeec7ebf9c]
aws_key_pair.main: Refreshing state... [id=mac-keypair]
aws_vpc.main: Refreshing state... [id=vpc-010dcff9b549d264f]
aws_s3_bucket.website: Refreshing state... [id=portfolio-prod-website]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=portfolio-prod-website]
aws_s3_bucket_website_configuration.website: Refreshing state... [id=portfolio-prod-website]
aws_s3_bucket_policy.website: Refreshing state... [id=portfolio-prod-website]
aws_acm_certificate.portfolio_cert: Refreshing state... [id=arn:aws:acm:us-east-1:741448918679:certificate/20d2101e-1783-4277-9677-4154be22c888]
aws_cloudfront_distribution.main: Refreshing state... [id=E2U6VGNQ4WZZLL]
aws_internet_gateway.main: Refreshing state... [id=igw-0bd97a226e607719e]
aws_subnet.public: Refreshing state... [id=subnet-0e0d18de26fe9b57e]
aws_security_group.ec2_public: Refreshing state... [id=sg-00c879139d2ed8945]
aws_route_table.public: Refreshing state... [id=rtb-0f8523643b80040fd]
aws_instance.app: Refreshing state... [id=i-04c0993838cff7f83]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-084f9946195368129]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2_profile will be created
  + resource "aws_iam_instance_profile" "ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2-ssm_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2-ssm-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_ssm_role will be created
  + resource "aws_iam_role" "ec2_ssm_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2-ssm-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "ec2-ssm-role"
    }

  # aws_instance.app will be updated in-place
  ~ resource "aws_instance" "app" {
      + iam_instance_profile                 = "ec2-ssm_profile"
        id                                   = "i-04c0993838cff7f83"
        tags                                 = {
            "Name" = "portfolio-ec2"
        }
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>